Since `resource_manager_id` property is now deprecated in both resources in particular `azurerm_storage_share` and this value is available as id in resources using storage_account_id, after making the changes suggested we are still seeing all our `azurerm_role_assignment` resources being wanting to be re-created

```
  # azurerm_role_assignment.xx must be replaced
-/+ resource "azurerm_role_assignment" "xx" {
      ~ id                                     = "/subscriptions/11111111-1111-1111-1111-11111111111/resourceGroups/xx/providers/Microsoft.Storage/storageAccounts/xx/fileServices/default/fileshares/xx/providers/Microsoft.Authorization/roleAssignments/11111111-1111-1111-1111-11111111111" -> (known after apply)
      ~ name                                   = "11111111-1111-1111-1111-11111111111" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/11111111-1111-1111-1111-11111111111/providers/Microsoft.Authorization/roleDefinitions/11111111-1111-1111-1111-11111111111" -> (known after apply)
      ~ scope                                  = "/subscriptions/11111111-1111-1111-1111-11111111111/resourceGroups/xx/providers/Microsoft.Storage/storageAccounts/xx/fileServices/default/fileshares/xx" -> "/subscriptions/11111111-1111-1111-1111-11111111111/resourceGroups/xx/providers/Microsoft.Storage/storageAccounts/xx/fileServices/default/shares/xx" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```